basic/modules/Admin/Articles/models/Articles.php

    public function RelateMe()
    {
        $user_id = $this->getCustomId(); //得到session登录用户的session信息的id
        $school_id = $this->getCustomSchool_id(); //得到session登录用户的session信息的id
        $page = isset($_REQUEST['page']) ? $_REQUEST['page'] : 1;
        $page_size = isset($_REQUEST['size']) ? $_REQUEST['size'] : 10;
        $start_line = $page_size * ($page - 1);
        $mc_name = $this->getMcName() . 'RelateMe' . $school_id . $user_id . $page . $page_size;
        if ($val = $this->mc->get($mc_name)) {
            $result = $val;
        } else {
            $query = new Query();
            //$list = $query->select('ar.contents as reply_content,ar.createtime as reply_time,ar.repliers_id,articles.*')
            $list = $query->select('ar.*,c.name_zh as replier_name,c.cat_default_id as replier_role_id,ar.reply_id,c2.name_zh as reply_name,c2.cat_default_id as reply_role_id,ar.createtime as reply_time,articles.id as article_id,articles.contents as article_contents,articles.title,customs.name_zh as author_name,customs.cat_default_id as author_role_id')
                //->distinct()
                ->from('article_replies as ar')
                ->leftjoin('articles', 'articles.id = ar.article_id')
                ->leftjoin('customs as c', 'c.id = ar.repliers_id')
                ->leftjoin('customs as c2', 'c2.id = ar.reply_id')
                ->leftjoin('customs', 'customs.id = articles.author_id')
                ->where(['ar.reply_id' => $user_id])
                ->orderby(['ar.id' => SORT_DESC])
                ->offset($start_line)
                ->limit($page_size)
                ->all();
---
SELECT `article_replies`.*, `customs`.`name_zh` AS `repliers_name`, `customs`.`cat_default_id` AS `repliers_role_id`, `c`.`name_zh` AS `reply_name`, `c`.`cat_default_id` AS `reply_role_id` FROM `article_replies` LEFT JOIN `customs` ON customs.id = article_replies.repliers_id LEFT JOIN `customs` `c` ON c.id = article_replies.reply_id WHERE ((`article_replies`.`article_id`='1525') AND (`article_replies`.`repliers_id`=662)) OR ((`article_replies`.`article_id`='1525') AND (`article_replies`.`reply_id`=662)) ORDER BY `article_replies`.`id`